[{"name": "Knight's Steakhouse", "description": "Knight’s is your textbook steakhouse with swimming pool-sized cocktails. While the restaurant has a flashier Liberty Street location in the vibrant downtown area, the original Dexter Avenue eatery’s historical charm makes it a classic.", "address": "2324 Dexter Road, Ann Arbor, MI 48103, Ann Arbor, MI 48103", "phone": "(734) 665-8644", "url": "http://www.knightsrestaurants.com/"}, {"name": "Krazy Jim's Blimpy Burger", "description": "This humble burger joint is the epitome of the town’s counterculture identity. The dizzyingly wide variety of combinations and the unique cooking methods are the antitheses of the gourmet burger chains that have proliferated across the country. While some label the burgers as laden with “grease”, the preferred term is “natural juices.”", "address": "304 S Ashley St, Ann Arbor, MI 48104", "phone": "(734) 663-4590", "url": "https://www.blimpyburger.com/"}, {"name": "The Earle Restaurant", "description": "Tucked away in its underground location, the Earle’s French and Italian menu has not changed since the 1970s. Dimly lit and with live jazz, it’s a popular destination for romantic dinners. The wine list offers more than 1,200 different selections.", "address": "121 W Washington St, Ann Arbor, MI 48104", "phone": "(734) 994-0211", "url": "http://www.theearle.com/"}, {"name": "Frita Batidos Ann Arbor", "description": "Celebrity chef and Ann Arbor local Eve Aronoff opened her Frita Batidos as an ode to Cuban street food. The fritas (chorizo-based burgers) and batidos (tropical milkshakes) served in the stark-white dining room sets it apart from anything else in Ann Arbor — and the Midwest.", "address": "117 W Washington St, Ann Arbor, MI 48104", "phone": "(734) 761-2882", "url": "http://fritabatidos.com/"}, {"name": "Pacific Rim by Kana", "description": "Although Ann Arbor has a wide variety of Asian restaurants, Pacific Rim stands alone as the only fine dining entry. French techniques, quality ingredients, roots firmly planted in pan-Asian cuisine, and a romantic atmosphere makes Pacific Rim a go-to destination for date night.", "address": "114 W Liberty St, Ann Arbor, MI 48104", "phone": "(734) 662-9303", "url": "http://pacificrimbykana.com/"}, {"name": "Jolly Pumpkin Café & Brewery", "description": "Michigan is recognized nationally as a microbrew destination and Jolly Pumpkin’s small-batch, artisanal beers are in a class by themselves. Its ales have topped lists of Belgian-style beers that include breweries from, well, Belgium. Vegetarians and omnivores alike have several items from which to choose.", "address": "311 S Main St, Ann Arbor, MI 48104", "phone": "(734) 913-2730", "url": "https://annarbor.jollypumpkin.com/"}, {"name": "Spencer", "description": "Spencer has wasted no time in putting its stamp on the local restaurant scene. The small space and casual atmosphere make it easy to miss. However, the commitment to seasonal, micro-local sources, and beautiful presentation has gained it national attention.", "address": "113 E Liberty St, Ann Arbor, MI 48104", "phone": "(734) 369-3979", "url": "http://www.spencerannarbor.com/"}, {"name": "Zingerman's Delicatessen", "description": "This Ann Arbor institution is considered one of the country's best delis. Dozens of sandwich options all on house-made bread with top-quality ingredients make it worth the wait and the price. Bakery and specialty items make it a food lover’s paradise.", "address": "422 Detroit St, Ann Arbor, MI 48104", "phone": "(734) 663-3354", "url": "http://www.zingermansdeli.com/"}, {"name": "Mani Osteria and Bar", "description": "The menu features innovative, wood-fired Neapolitan pizzas, small plates, and salads. The dishes are meant to be shared which, along with an open-concept dining room, gives Mani the liveliest and most energetic atmosphere in town.", "address": "341 E Liberty St, Ann Arbor, MI 48104", "phone": "(734) 769-6700", "url": "https://maniosteria.com/"}, {"name": "Tomukun Noodle Bar", "description": "What began as a noodle bar, featuring several kinds of East Asian comfort foods now includes a full-on Korean barbecue section with tabletop grills and other Korean standards. Tomukun may be the best place to see townies and students dining in perfect harmony.", "address": "505 E Liberty St #200, Ann Arbor, MI 48104", "phone": "(734) 995-8668", "url": "http://noodlebar.tomukun.com/"}, {"name": "Sava's", "description": "Sava’s occupies a prominent spot on State Street and in the hearts of many in the Ann Arbor area. Their Mediterranean-influenced menu is filled with well-thought-out dishes using quality ingredients and refined techniques. The charred branzino and whole poussin are must-have items.", "address": "216 S State St, Ann Arbor, MI 48104", "phone": "(734) 623-2233", "url": "http://www.savasannarbor.com/"}, {"name": "Seoul Street", "description": "Tucked in the back corner of a small apartment building, behind other restaurants, in a town with many Korean restaurants, it’s easy to overlook Seoul Street. The Korean standards are all represented well, but what sets it apart from similar spots is the fried chicken. Coated in either a hot and spicy or soy-garlic glaze, it can’t be missed. Order online to avoid long wait times.", "address": "1771 Plymouth Rd, Ann Arbor, MI 48105", "phone": "(734) 719-0085", "url": "http://www.eatseoulstreet.com/"}]