[{"name": "Noble Fish", "description": "Whenever the subject of sushi in metro Detroit comes up, the discussion almost always turns to Noble Fish, beloved for consistently providing metro Detroiters with a steady source of over-sized sushi rolls and nigiri for the past 30 years. What started as a market in 1984 later added a kitchen in 1991, along with a modest sushi bar where guests could marvel at the sushi chefs’ expertise in assembling fresh cuts of fish. More recently, the spot added an expanded dining area where diners can stretch their legs a bit in a casual atmosphere that’s a step above the grocery store vibes from before. A variety of traditional Japanese snacks like candy, cookies, and rice cakes are also on hand, as well as bottled teas, sake, and other Japanese beverages. The prices are reasonable. Go for the nigiri like yellowtail or splurge on a large specialty roll like the Michigan, made with tuna, cucumber, avocado, and spicy mayo.", "address": "45 E 14 Mile Rd, Clawson, MI 48017", "phone": "(248) 585-2314", "url": "http://www.noblefish.com/"}, {"name": "Sozai Restaurant", "description": "One of the most critically-lauded sushi restaurants in recent years, Sozai is known both for its commitment to sustainable sourcing practices and for its omakase meals. Make a reservation and order omakase from the sushi bar for a multi-course meal, which grants diners access to dishes that aren’t usually on the menu. The omakase menu gives guests several options ranging from seven courses to the kappo — an hours-long meal that’s limited only by the chef’s imagination.", "address": "449 W 14 Mile Rd, Clawson, MI 48017", "phone": "(248) 677-3232", "url": "https://www.sozairestaurant.com/"}, {"name": "Mabel Gray", "description": "Chef James Rigato of Top Chef fame helms this Hazel Park restaurant. What made this spot stand out when it opened in 2015 was that it was among the earlier new American restaurants in metro Detroit to feature a menu that’s handwritten and that changes daily and with the seasons. Rigato takes his cooking seriously, but the space itself does not feel pretentious, so expect mismatched vintage plates and seating inside a compact dining area in an otherwise sleepy suburb. One visit might entail griddled king trumpet mushrooms, while a return trip could include Colorado lamb ribs made with garlic and fish sauce caramel, sake pickles, sesame, and iceberg lettuce. Reservations are recommended, though the lone diner can occasionally score a seat at the bar if they call ahead and inquire about last-minute cancellations.", "address": "23825 John R Rd, Hazel Park, MI 48030", "phone": "(248) 398-4300", "url": "http://mabelgraykitchen.com/"}, {"name": "Petty Cash", "description": "This New American restaurant draws from the legacy of Black Southern culinary traditions and brings an “upscale casual” dining experience to the Avenue of Fashion. Guests can expect Southern cooking techniques that incorporate inspiration from other regions across the globe, including northern Africa, the Middle East, and Mediterranean on a seasonal, vegan-friendly menu.", "address": "20050 Livernois, Detroit, MI 48221", "phone": "(313) 380-6336", "url": "http://pettycashdetroit.com/"}, {"name": "Good Cakes and Bakes", "description": "This welcoming, pretty-in-pink bakery and cafe on Livernois is an oasis for delectable cakes, such as its strawberry crunch cake made with three thick layers of spongy strawberry and vanilla cake, moist cupcakes like the banana pudding cupcake, colorful cereal and milk bars, as well as a select number of savory items like soups and breakfast sandwiches. During Pride Month, expect specialities like the Rainbow Sprinkle, made with six brightly-hued layers and white frosting. Good Cakes and Bakes is also available for nationwide delivery via Goldbelly.", "address": "19363 Livernois, Detroit, MI 48221", "phone": "(313) 468-9915", "url": "http://www.goodcakesandbakes.com/"}, {"name": "Chef Greg’s Soul-N-the Wall", "description": "When it comes to Detroit sandwiches, few have achieved the legendary status of the Boogaloo Wonderland at Chef Greg’s Soul-N-the Wall: a hoagie topped with beef, tangy red sauce, American cheese, and caramelized onions. This carryout spot’s signature dish pays tribute to an original recipe at the now-shuttered Brothers Bar-B-Q and to the late “Boogie Wonderland” songwriter Allee Willis, who happened to be a big fan of proprietor Greg Beard’s food.", "address": "10009 Curtis St, Detroit, MI 48221", "phone": "313-861-0331", "url": "https://www.soul-n-thewall.com/"}, {"name": "Louisiana Creole Gumbo", "description": "Spiced gumbo loaded with seafood is the main event at this decades-old carryout restaurant that originated near Eastern Market. At this Detroit institution, it’s served with shrimp, sausage, cut okra, celery, onions, tomatoes, and a proprietary blend of gumbo seasonings, alongside Bayou favorites like red beans and rice, jambalaya, and shrimp po’boys. The original spot is looking to relocate from its Eastern Market location, but there’s a second outpost on Seven Mile and one that opened in October 2021 in Farmington Hills.", "address": "13505 W Seven Mile Rd, Detroit, MI 48235", "phone": "(313) 397-4052", "url": "https://detroitgumbo.com/"}, {"name": "The Jamaican Pot", "description": "Good things come in small packages, like the city’s best jerk chicken served up in a strip mall off Eight Mile. While the Jamaican Pot is exclusively carryout, expect to wait a bit while the busy kitchen carefully prepares each order of curry goat and pepper steak. The jerk chicken is made with flame-grilled chicken that’s seasoned with a blend of island spices. To drink, cool down that heat with a bottle of Kola Champagne or keep that spice going with a ginger beer.", "address": "14615 W 8 Mile Rd, Detroit, MI 48235", "phone": "(313) 659-6033", "url": "https://www.thejamaicanpot.com/"}, {"name": "Detroit Vegan Soul", "description": "A haven for vegetarians and carnivores alike, Detroit Vegan Soul offers animal product-free twists on traditional soul food dishes such as macaroni and “cheese,” seitan pepper steak, and smothered almond tempeh.", "address": "19614 Grand River Ave, Detroit, MI 48223", "phone": "(313) 766-5728", "url": "http://www.detroitvegansoul.com/"}, {"name": "Sweet Potato Sensations", "description": "Sweet potato ice cream, chicken and sweet potato waffles, sweet potato cookies and cornbread — Sweet Potato Sensations does it all, working hard to preserve the legacy of George Washington Carver, who learned more than 100 uses for the sweet potato and other plants native to the South. Headed to the Old Redford neighborhood bakery? Try the pie first. Etta Mae’s salmon croquettes, the Jive Turkey Sandwich, and the black-eyed pea and collard green soup are worthy contenders, too.", "address": "17337 Lahser Rd, Detroit, MI 48219", "phone": "(313) 532-7996", "url": "http://sweetpotatosensations.com/"}, {"name": "Joe Ann's Bar B-Q", "description": "Founded by Grace Owens, Joe Ann’s BBQ has been carrying on the tradition of open charcoal pit barbecue since 1951. These days, Owens’s daughter Joe Ann Proctor is keeping that family tradition alive: Customers can expect options like whole barbecued chicken, tender ribs, and pigs’ feet — all cooked on-site over an open charcoal-fired pit. The fried shrimp paired with Joe Ann’s tangy, spicy barbecue sauce and the tropical shakes are also worth stopping in for.", "address": "3139 Jerome St, Detroit, MI 48212", "phone": "(313) 366-3775", "url": "http://www.thebalkanhouse.com/"}, {"name": "Balkan House", "description": "This casual Eastern European eatery makes its home in the lower half of a two-story flat in Hamtramck, but also in Ferndale and, more recently, in a food truck for special events. Customers can count on Bosnian dishes like cevapi and cream cheese-stuffed hamburgers, Turkish coffee, and the restaurant’s claim to fame — döner. Thin-sliced gyro meat, crisp lettuce, tomatoes, cucumbers, and onion are stuffed inside soft-on-the-inside, crispy-on-the-outside lepinja flatbread with sauce drizzled over the top. The menu is halal and available for takeout or delivery.", "address": "3028 Caniff St, Hamtramck, MI 48212", "phone": "(313) 262-6234", "url": "https://www.yemencaferestaurant.com/"}, {"name": "Yemen Cafe", "description": "This local favorite is known for its Yemeni and Mediterranean cuisine served until 1 a.m. daily in a diner-style atmosphere with cushy booth seating, hints of Arabic decor, and a complementary self-serve tea station. Expect platter-sized pieces of fresh flatbread and flavorful zhug paired with dishes like chicken ghallaba and tender lamb.", "address": "8740 Joseph Campau Ave, Hamtramck, MI 48212", "phone": "(313) 871-4349", "url": "http://www.saffrondetwah.com/"}, {"name": "Saffron De Twah", "description": "A 2019 award winner for Eater Detroit’s restaurant of the year, Saffron De Twah has proven itself to be not only a great spot for takeout but also an advocate for its community. Chef Omar Anani has prepared meals for people in need through a variety of Saffron Community Kitchen programs, including a collaboration with Brilliant Detroit, a nonprofit that works with children and families in Detroit neighborhoods to promote education, security, and health. The dining space is modest but welcoming, with a heated enclosed patio space. Diners can enjoy Moroccan-influenced cuisine, such as a shareable tomato sauce made with whipped goat cheese and an incredibly crispy and popular fried chicken sandwich, and a sizable menu of nonalcoholic cocktails.", "address": "7636 Gratiot Ave, Detroit, MI 48213", "phone": "(586) 359-6138", "url": "http://rosesfinefood.com/"}, {"name": "Rose's Fine Food and Wine", "description": "Charming East Jefferson restaurant Rose’s Fine Food and Wine puts a fresh, seasonal twist on the diner genre with its charming outdoor patio and garden. It does this even more so with its menu, which features a variety of paninis and toasts made with house-made bread; locally sourced salads; daily specials; sweet pastries baked fresh; a full espresso beverage menu; and an expansive list of wines to go. Rose’s also has made-to-order cakes of any size — whether you’re looking for something fancy for an intimate picnic for two on Belle Isle, or something for the big wedding party. Looking forward, the eatery has plans to launch a kitchen garden cooking school to inspire the next generation of culinary excellence in the city.", "address": "10551 E Jefferson Ave, Detroit, MI 48214", "phone": "(313) 822-2729", "url": "http://www.corianderkitchenandfarm.com/"}, {"name": "Coriander Kitchen and Farm", "description": "If you can’t go to Venice or Amsterdam, canal-side dining in in Jefferson Chalmers might be the next best thing. This casual spot offers a garden-like setting with views of the water (some folks even kayak to the restaurant) and a regularly changing scratch menu featuring local produce that’s romantic without being stuffy. The canal-side destination now also features extended daytime hours during the week, a grab-and-go retail section, space for private events, and community-focused programming like live music.", "address": "14601 Riverside Blvd, Detroit, MI 48215", "phone": "(313) 338-9466", "url": "http://sisterpie.com/"}, {"name": "Sister Pie", "description": "Sister Pie is a nationally renowned Detroit bakery with a fresh rotation of pie flavors rolling out monthly. Expect the unexpected in seasonal pie flavors, ranging from Michigan strawberry, rhubarb, and lavender; toasted marshmallow butterscotch; or the crowd favorite, salted maple. The shop, helmed by Eater Young Gun Lisa Ludwinski (’15), emphasizes the needs of its employees and surrounding neighbors by hiring from within the community and regularly checking in with customers to find out their priorities.", "address": "8066 Kercheval Ave, Detroit, MI 48214", "phone": "(313) 447-5550", "url": "http://www.marrowdetroit.com/"}, {"name": "Marrow", "description": "Named one of Eater’s best new restaurants in 2019, Marrow has been a crucial source for everything from local meats and cheeses to flour to beer and wine. The West Village butcher shop and restaurant features a prix fixe, five-course tasting menu to give diners a little taste of everything, as well as a la carte options like the roast bone marrow, local maitake and crayfish dumplings, ricotta gnocchi, or the baklava doughnut. The kitchen is helmed by chef Sarah Welch, who on top of running a restaurant has been featured on two seasons of Top Chef.", "address": "8044 Kercheval Ave, Detroit, MI 48214", "phone": "(313) 652-0200", "url": "http://www.pietrzykpierogi.com/"}, {"name": "Pietrzyk Pierogi", "description": "Owner Erica Pietrzyk is known for her nontraditional takes on Polish dumplings like the Holiday Special, a pierogi packed with turkey, potatoes, stuffing, and green beans. It’s those kinds of fun flavors that turned Pietrzyk Pierogi into a hit pop-up restaurant and now a food stall inside Gratiot Central Market. Pietrzyk offers in-store shopping, curbside service, and shipping with an online shop, where customers can order packages of frozen pierogi, meal kits with Polish staples, and even pay-it-forward meals to help people in need. Pietrzyk is also available at 20 local retail locations.", "address": "1429 Gratiot Ave Suite 109, Detroit, MI 48207", "phone": "(313) 614-9393", "url": "https://www.barpigalle.com/"}, {"name": "Bar Pigalle", "description": "Bar Pigalle takes a “playful French”-meets-Midwest approach to its dramatically renovated space set on the ground level of the historic Carlton Lofts in Brush Park. Behind the venture are hospitality veterans Joseph Allerton and Travis Fourmont, along with chef Nyle Flynn. The Eater Award-winning spot is named after the Parisian neighborhood Quartier Pigalle — home of the famous Moulin Rouge. Expect a variety of hot or cold small plates like bison tartare guanciale-wrapped frog legs, and a coney-style steak and frites, along with an impressive cocktail, beer, and wine list.", "address": "2915 John R St, Detroit, MI 48201", "phone": "(313) 497-9200", "url": "http://www.seldenstandard.com/"}, {"name": "Selden Standard", "description": "This dinner spot for new American cuisine takes diners into a beautifully restored interior with reclaimed wood, subway tile walls, and a minimalist aesthetic and a menu focusing on seasonal small plates. Think halloumi, octopus, roasted carrot salad, and rigatoni, just to name a few past menu items. The cocktails are equally as creative with ample use of seasonal fruit, local herbs or shrubs, and house-made syrups. Reservations are available 5 p.m. to 10 p.m. Wednesday through Sunday.", "address": "3921 2nd Ave, Detroit, MI 48201", "phone": "(313) 438-5055", "url": "https://warda-patisserie-midtown.square.site/"}, {"name": "Warda Pâtisserie", "description": "Eater Award-winning bakery Warda Patisserie serves some of Detroit’s best desserts from its charming cafe on West Alexandrine. Owner Warda Bouguettaya — who won the 2022 James Beard Award for outstanding pastry chef — specializes in stunning tarts, pastries, and breads influenced by her world travels. Look out for options like pear and almond frangipane tarts, quiche, and cream-filled maritozzi. Stay awhile in the bistro-style seating section with a latte or take your treats on the go.", "address": "70 W Alexandrine St, Detroit, MI 48201", "phone": "(313) 262-6977", "url": "http://midtownshangri-la.com/"}, {"name": "Shangri-La", "description": "This Cantonese restaurant in the Cass Corridor is a popular destination for all-day dim sum like steamed pork buns, rice rolls, and cakes, as well as a variety of curries, noodle dishes, and soups. The unpretentious setting — with two- and four-seat tables, along with limited bar seating — is a great place for dining in (and people-watching), although takeout is popular, too.", "address": "4710 Cass Ave, Detroit, MI 48201", "phone": "(313) 974-7669", "url": "http://bardadetroit.com/"}, {"name": "BARDA", "description": "Chef Javier Bardauil hails from Argentina and prior to opening Barda in 2021, he spent the previous few decades working in kitchens in the South American country, Spain, and elsewhere. Expect to be immersed in Bardauil’s mindset as you enter the Core City space. The moody red lighting, ambient Latin background music, knowledgeable servers, and bartenders who meet you at eye-level at the bar are all meant to engage your senses so that all of your attention is paid to the dining experience at hand. The menu is a celebration of Argentine cuisine, meaning an emphasis on beef, as well as cooking over an open, wood-fired flame. The towering pepper-coriander encrusted short rib and the carne y hueso — Bardauil’s take on bone marrow and beef tartare — are expertly executed and go well with a glass of Argentine wine or a mezcal-infused cocktail. The veggies also get the special fire treatment as their flavors are amplified by smolder and ash.", "address": "4842 Grand River Ave, Detroit, MI 48208", "phone": "(313) 952-5182", "url": "https://www.yumvillage.com/"}, {"name": "Yumvillage", "description": "Specializing in flavorful Afro Caribbean dishes served in the style of a grain bowl, Yum Village has become beloved for its jerk chicken, curry chicken, crisp and juicy suya fried chicken, and vegan akara (black-eyed pea fritters). Protein options can also be built into a combo bowl with additions like maafe rice (flavored with West African peanut stew), fried ginger-curry chickpeas, sweet pepper salad, and West African jollof rice with tomato, garlic, and smoked peppers. While the spot makes for the ideal meal on the go with its mobile-friendly meals in a bowl, Yum Village is also licensed to serve liquor, so winding down with a drink and filling meal is welcomed here. A second location in West Village has also given eastsiders more options for fiery Afro Caribbean cuisine, and coming soon, Yum Village will also be taking over the kitchen at El Club in southwest Detroit.", "address": "6500 Woodward Ave, Detroit, MI 48202", "phone": "(313) 334-6099", "url": "https://www.baobabfare.com/"}, {"name": "Baobab Fare", "description": "Baobab Fare is owned and operated by husband-and-wife team Nadia Nijimbere and Hamissi Mamba, who fled Burundi for the United States in 2014. The restaurant serves tasty recipes — including an incredibly flavorful mbuzi (slowed-roasted goat shank with corn salad, plantains, yellow beans, and rice), weekly specials like the ugali (a traditional East African dish made up of a dense corn flour ball, served with savory okra stew) served every Tuesday, and Ji, the eatery’s signature bottled passionfruit juice. In addition, Baobab Fare also recently expanded to include a food truck, Waka, and a line of packaged food items available for retail at several local grocers and cafes.", "address": "6568 Woodward Ave Suite 100, Detroit, MI 48202", "phone": "(313) 265-3093", "url": "https://www.freyadetroit.com/"}, {"name": "Freya & Dragonfly", "description": "This spot offers dinner and drinks in one building. For $90, diners can experience a multicourse menu that can last several hours and highlights the bounty of each season. A recent menu included Island Creek oysters accompanied with compressed melon, Michigan baby carrots charred with toasted pistachio, Michigan sweet corn agnolotti, and chocolate almond custard. The space feels very relaxed, with a minimal and elegant dining space with exposed brick and a host stand made of reclaimed wood, as well as an open kitchen where guests can witness the back-of-house crew at work. One key detail: Diners can select their playlist while they eat, thanks to the restaurant’s robust collection of vinyls. Next door, the Dragonfly bar boasts a low-ABV menu along with a lineup of signature cocktails that changes regularly, creative small bites like duck tenders. The spot now opens up its space for up-and-coming chefs like the women of Fried Chicken & Caviar, who’ve hosted the Communion Sunday brunch pop-up experience featuring a curated drink menu, special food items, and an eclectic playlist.", "address": "2929 E Grand Blvd, Detroit, MI 48202", "phone": "(313) 351-5544", "url": "https://www.oakandreel.com/"}, {"name": "Oak & Reel", "description": "Exceptional seafood is the star of the menu at Oak and Reel. Michigan native chef Jared Gadbaw developed his craft and knowledge of Italian seafood while working at a two Michelin-starred New York restaurant before returning to the Great Lakes region to establish his own restaurant in Milwaukee Junction. Customers can enjoy a variety of options with Oak and Reel’s raw oysters and other menu items that have included roasted swordfish; snail-shaped lumache pasta with squid ink, shrimp, crab, and herbs; or salt-baked branzino with salsa verde and seasonal garnishes — all set in a chic, minimalist interior that boasts exposed ceilings, soft lighting, and a ground-level view of the Boulevard. In addition, the Upright, a cozy bar and lounge, is situated beneath the restaurant. Guests of the bar can enjoy cocktails and small plates like bolognese arancini, and cacio e pepe pasta fritti — crispy pasta bites with parmesan and pepper.", "address": "2921 E Grand Blvd, Detroit, MI 48202", "phone": "(313) 270-9600", "url": "http://www.michigantrumbullpizza.com/"}, {"name": "Michigan & Trumbull", "description": "The argument over who does Detroit-style square pizza best is a contentious debate, and one needn’t take a side. There are plenty of excellent pan pizzas around the region. However, for those in the mood for a little razzle dazzle with their caramelized cheesy corners, Michigan & Trumbull is the place to be. Offerings include a selection or Detroit-style red and white pizza, New York-style rounds, and deep-fried calzones as well as salads, roasted veggies, and wines, beers, and select pantry items. The beloved pizzeria recently announced plans to relocate to the city’s Elijah McCoy Neighborhood just south of the Henry Ford Medical Center in July 2023.", "address": "1441 W Elizabeth St, Detroit, MI 48216", "phone": "(313) 637-4992", "url": "http://mudgiesdeli.com/"}, {"name": "Mudgie's Deli and Bar", "description": "From the friendly staff, lunch, beer, and wine offerings, Mudgie’s Deli continues to serve as a community gathering place for Corktown. Dig into excellent sandwiches like the Mayor — featuring salami, turkey, cheddar, banana peppers, romaine lettuce, and chipotle mayo on rye bread. The indoor dining space gives off old-school deli vibes with lived-in hardwood floors and casual seating, while the bar and outdoor patio areas are charming additions to the neighborhood.", "address": "1413 Brooklyn St, Detroit, MI 48226", "phone": "(313) 961-2000", "url": "http://www.batchbrewingcompany.com/"}, {"name": "Batch Brewing Company", "description": "Batch Brewing Company’s menu has been leaning into barbecue as of late, available for dining in or carryout, as are its brews in bottles and cans. The brewery currently offers lots of outdoor seating under an open-air pavilion, as well as indoor seating. The space has also become known for uplifting community through its various pop-ups and fundraisers in support of other local businesses impacted by the pandemic and other crises, like a Monday and Tuesday pop-up featuring Taqueria El Rey, which currently offers its chargrilled chicken, tacos, and burritos at the spot two nights a week.", "address": "1400 Porter St, Detroit, MI 48216", "phone": "(313) 338-8008", "url": "http://www.imaizakaya.com/"}, {"name": "Ima Izakaya", "description": "Chef Mike Ransom’s Eater Award-winning restaurants in Corktown, Midtown, and Madison Heights are known for their udon noodles swimming in rich earthy broths, and karaage fried chicken or tofu sandwiches — all set in a casual, bright space with available indoor and outdoor seating. Now Ransom is bringing his vision full circle with its newly expanded digs in the former Gold Cash Gold restaurant just west of the original Corktown spot on Michigan Avenue. Expect a more robust cocktail menu, meaty skewers from the robata grill like the delectable tsukune chicken meatballs, raw fish options like the velvety hamachi tuna crudo and ahi tuna tartare, panko-fried chicken katsu, and many other favorites.", "address": "2100 Michigan Ave, Detroit, MI 48216", "phone": "(313) 306-9485", "url": "https://www.facebook.com/TamaleriaNuevoLeon/"}, {"name": "Tamaleria Nuevo Leon", "description": "Carryout-only fave Tamaleria Nuevo Leon has been satisfying Detroiters’ Christmastime tamale needs since the 1950s. The satisfying lineup of tamales sticks with classic fillings like pork and chicken alongside rotating specials like cheese-jalapeño tamales. The tamales tend to be on the thin side, a good thing for folks looking for just the right balance of fillings and masa. Oh, and the masa has a comforting corn flavor that’s not too starchy. It’s also known for its fast, friendly service, where you can call to order and have your to-go bag waiting in just minutes or order from a window outside — a relatively new pandemic-related addition. Don’t forget to bring cash.", "address": "2669 Vernor Hwy, Detroit, MI 48216", "phone": "(313) 962-8066", "url": "https://www.ladder4winebar.com/"}, {"name": "Ladder 4 Wine Bar", "description": "The Eater Award-winning Ladder 4 operates as a wine bar, and a retail wine shop — with more than 200 varieties for sale. But the space also features a full-scale dinner menu developed by John Yelinek, who also helms the popular Park Ranger pop-up. The spot also hosts live music events, has three spacious patios and a backyard.", "address": "3396 Vinewood St, Detroit, MI 48208", "phone": "(313) 638-1601", "url": "https://www.facebook.com/DulysConeyIsland"}, {"name": "El Parian Taco truck", "description": "Southwest Detroit is arguably the taco truck capital of the city and the Diaz family behind El Parian mobile food trucks are in many ways leading the pack. With several locations that can reliably be found at the same address daily, El Parian offers a little something for everyone at each of its locations. Fan favorites include Parian’s fiery yet slightly tangy and chargrilled tacos al pastor, complete with slivers of pineapple; tacos campechano (asada mixed with chorizo); and tacos filled with tender cuts of suadero. For fans of mariscos, hit up El Imperio at 7812-7816 Vernor Highway for a variety of seafood cocktails, citrusy ceviche served on top of crispy tostadas, and even chilled oysters. For a choice of Mexican and burgers, Wicho’s Burgers offers thick Hawaiian burgers and satisfying tacos alike. While the locations are pretty consistent, be sure to follow Parian’s social media accounts for updates.", "address": "4804 Vernor Hwy, Detroit, MI 48209", "phone": "(313) 554-3076", "url": "http://elasadordetroit.com/"}, {"name": "Duly's Place", "description": "For a late-night taste of Detroit’s famous coney dog — a chili dog with mustard and onions on a steamed bun — there’s no better spot to indulge than Duly’s Place. With more than 90 years under its belt, the diner is still a go-to spot for coney island classics with consistency and an essential greasy-spoon atmosphere. Come for dogs with a satisfying snap or a wallet-friendly breakfast of bacon, eggs, and pancakes. Just be prepared: Duly’s takes cash only, so hit up an ATM on the way.", "address": "5458 Vernor Hwy, Detroit, MI 48209", "phone": "(313) 297-2360", "url": "http://hamidorestaurant.com/"}, {"name": "El Asador Steakhouse", "description": "Southwest Detroit is famous for its vast array of Mexican food, but El Asador reminds diners that there’s more to the cuisine than tacos. This small, charming restaurant on Springwells gives classic steakhouse vibes with a Mexican flair. Here diners go to  splurge on a juicy rib-eye steak topped with a creamy poblano pepper sauce, a cazuela de mariscos — served in an oversized dish filled with sauteed shrimp, salmon, mahi mahi, scallops, mussels, calamari, and lobster in a tomato-based broth — or guacamole prepared tableside. Reservations are recommended for indoor dining or for seating — parties of four or more — in one of the all-season, enclosed outdoor luminaria. Trays to go, piled with tacos, fajitas, chile rellenos, or nachos, are perfect for large parties. El Asador is also mindful to cater to the needs of its Muslim customers and all of its meat options are halal.", "address": "1312 Springwells St, Detroit, MI 48209", "phone": "(313) 582-0660", "url": "http://www.noblefish.com/"}, {"name": "Hamido", "description": "Hamido, a bustling Lebanese diner in Dearborn and Dearborn Heights, is great for Lebanese breakfast staples or entrees like a crisp, refreshing fattoush salad; falafel rich in pungent garlic flavor; shawarma; and kibbeh. Dine in or place an order for a meal platter to go and bask in abundant leftovers.", "address": "13251 W Warren Ave, Dearborn, MI 48126", "phone": "(248) 585-2314", "url": "https://www.sozairestaurant.com/"}]